In [7]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [9]:
df=pd.read_csv(r"C:\Users\PAVAN G\Downloads\archive\Position_Salaries.csv")
df

            Position  Level   Salary
0   Business Analyst      1    45000
1  Junior Consultant      2    50000
2  Senior Consultant      3    60000
3            Manager      4    80000
4    Country Manager      5   110000
5     Region Manager      6   150000
6            Partner      7   200000
7     Senior Partner      8   300000
8            C-level      9   500000
9                CEO     10  1000000

In [13]:
target= df["Salary"]
target

0      45000
1      50000
2      60000
3      80000
4     110000
5     150000
6     200000
7     300000
8     500000
9    1000000
Name: Salary, dtype: int64

In [17]:
from sklearn.preprocessing import LabelEncoder

In [19]:
le_Position=LabelEncoder()

In [31]:
df['Position']=le_Position.fit_transform(df["Position"])

In [33]:
df['Position']

0    0
1    4
2    8
3    5
4    3
5    7
6    6
7    9
8    1
9    2
Name: Position, dtype: int32

In [45]:
df=df.drop(["Position"],axis="columns")

In [47]:
df

   Level   Salary
0      1    45000
1      2    50000
2      3    60000
3      4    80000
4      5   110000
5      6   150000
6      7   200000
7      8   300000
8      9   500000
9     10  1000000